app/controllers/clips_controller.rb

INSERT INTO "clips" ("name", "description", "video_standard", "video_definition", "start_timecode", "end_timecode", "show_reel_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @clip = @show_reel.clips.new(clip_params)
    if @clip.save

SELECT "clips".* FROM "clips" WHERE "clips"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "clips" WHERE "clips"."id" = ?  [["id", 1]]
---
  def destroy
    @clip = Clip.find(params[:id])
    @clip.destroy

SELECT "show_reels".* FROM "show_reels" WHERE "show_reels"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def set_show_reel
    @show_reel = ShowReel.find(params[:show_reel_id])