app/controllers/show_reels_controller.rb

SELECT "show_reels".* FROM "show_reels"
---
    def index
      @show_reels = ShowReel.all

INSERT INTO "show_reels" ("name", "video_standard", "video_definition", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "M&M's"], ["video_standard", "PAL"], ["video_definition", "HD"], ["created_at", "2024-06-03 09:14:43.682276"], ["updated_at", "2024-06-03 09:14:43.682276"]]
---
    def create
      @show_reel = ShowReel.new(show_reel_params)
      if @show_reel.save

SELECT "show_reels".* FROM "show_reels" WHERE "show_reels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      @show_reel = ShowReel.find(params[:id])